d={1:100,2:99,3:88}
for a in d:
    print(a,d[a])
print('===================================================================')
c=[1,2,3,4,5]
d=[100,99,88,77,66,55]
for item in range(0,5):
    print(c[item],d[item])
print('====================================================================================')
d={'处女座':'处女本月综合运势并不乐观，很容易受到情绪的影响而变得冲动易怒，只有不断调整自身的情绪问题，才能够感受到幸福。'
         '进入2022年1月，处女座可佩戴一件红玛瑙摘星吉宏虎项链来喜迎虎年，红玛瑙月亮之上有萌虎摘星，红润喜庆的红玛瑙释放满满活力，'
         '提升人缘和感情运的同时，带来事业财运红红火火，萌虎摘星有获取财富幸运之意，期盼处女座们在新的一年能魅力四射，心想事成。'}
star=input('输入你的星座')
#print(d[star])
print(d.get(star,'不存在',))
for item in d:
    print(item,end=':')#关键字参数，不换行
    for i in d[item]:
        print(i,end='')
    print()